results/histogram/wrk_idle.log
Running 5m test @ http://11.11.66.3:8080/
  1 threads and 1 connections
  Thread calibration: mean lat.: 2.006ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.38ms  486.38us  13.99ms   83.20%
    Req/Sec    21.16     42.11   111.00     79.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.44ms
 75.000%    2.71ms
 90.000%    2.79ms
 99.000%    2.98ms
 99.900%    3.69ms
 99.990%   12.34ms
 99.999%   14.00ms
100.000%   14.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.101     0.000000            1         1.00
       1.519     0.100000          582         1.11
       2.123     0.200000         1160         1.25
       2.277     0.300000         1741         1.43
       2.375     0.400000         2329         1.67
       2.445     0.500000         2915         2.00
       2.489     0.550000         3203         2.22
       2.555     0.600000         3485         2.50
       2.633     0.650000         3781         2.86
       2.681     0.700000         4069         3.33
       2.709     0.750000         4367         4.00
       2.719     0.775000         4526         4.44
       2.727     0.800000         4664         5.00
       2.733     0.825000         4789         5.71
       2.747     0.850000         4941         6.67
       2.765     0.875000         5075         8.00
       2.777     0.887500         5148         8.89
       2.789     0.900000         5225        10.00
       2.801     0.912500         5296        11.43
       2.813     0.925000         5365        13.33
       2.827     0.937500         5441        16.00
       2.833     0.943750         5475        17.78
       2.841     0.950000         5511        20.00
       2.853     0.956250         5551        22.86
       2.865     0.962500         5582        26.67
       2.881     0.968750         5620        32.00
       2.889     0.971875         5637        35.56
       2.897     0.975000         5655        40.00
       2.909     0.978125         5675        45.71
       2.923     0.981250         5692        53.33
       2.945     0.984375         5711        64.00
       2.953     0.985938         5718        71.11
       2.961     0.987500         5729        80.00
       2.969     0.989062         5737        91.43
       2.985     0.990625         5745       106.67
       3.001     0.992188         5754       128.00
       3.013     0.992969         5759       142.22
       3.037     0.993750         5764       160.00
       3.057     0.994531         5768       182.86
       3.085     0.995313         5772       213.33
       3.181     0.996094         5777       256.00
       3.205     0.996484         5779       284.44
       3.225     0.996875         5781       320.00
       3.283     0.997266         5784       365.71
       3.313     0.997656         5786       426.67
       3.357     0.998047         5788       512.00
       3.417     0.998242         5789       568.89
       3.435     0.998437         5790       640.00
       3.661     0.998633         5792       731.43
       3.689     0.998828         5793       853.33
       4.899     0.999023         5794      1024.00
       4.899     0.999121         5794      1137.78
       5.991     0.999219         5795      1280.00
       7.739     0.999316         5796      1462.86
       7.739     0.999414         5796      1706.67
      10.175     0.999512         5797      2048.00
      10.175     0.999561         5797      2275.56
      10.175     0.999609         5797      2560.00
      12.335     0.999658         5798      2925.71
      12.335     0.999707         5798      3413.33
      12.335     0.999756         5798      4096.00
      12.335     0.999780         5798      4551.11
      12.335     0.999805         5798      5120.00
      13.999     0.999829         5799      5851.43
      13.999     1.000000         5799          inf
#[Mean    =        2.380, StdDeviation   =        0.486]
#[Max     =       13.992, Total count    =         5799]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6001 requests in 5.00m, 1.30MB read
Requests/sec:     20.00
Transfer/sec:      4.43KB