results/histogram/wrk_service_1k_churn.log
Running 8m test @ http://172.30.57.114:5432/
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.973ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.06ms    1.05ms  32.05ms   97.83%
    Req/Sec    20.81     41.39   111.00     79.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.96ms
 75.000%    2.21ms
 90.000%    2.38ms
 99.000%    5.68ms
 99.900%   16.42ms
 99.990%   24.64ms
 99.999%   32.06ms
100.000%   32.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.021     0.000000            1         1.00
       1.508     0.100000          982         1.11
       1.649     0.200000         1965         1.25
       1.760     0.300000         2941         1.43
       1.867     0.400000         3931         1.67
       1.964     0.500000         4901         2.00
       2.016     0.550000         5398         2.22
       2.067     0.600000         5904         2.50
       2.117     0.650000         6390         2.86
       2.151     0.700000         6864         3.33
       2.209     0.750000         7353         4.00
       2.237     0.775000         7605         4.44
       2.263     0.800000         7842         5.00
       2.293     0.825000         8095         5.71
       2.321     0.850000         8331         6.67
       2.349     0.875000         8576         8.00
       2.365     0.887500         8708         8.89
       2.383     0.900000         8830        10.00
       2.403     0.912500         8951        11.43
       2.429     0.925000         9068        13.33
       2.467     0.937500         9192        16.00
       2.493     0.943750         9258        17.78
       2.513     0.950000         9311        20.00
       2.557     0.956250         9372        22.86
       2.603     0.962500         9432        26.67
       2.679     0.968750         9493        32.00
       2.731     0.971875         9525        35.56
       2.811     0.975000         9555        40.00
       3.075     0.978125         9585        45.71
       3.621     0.981250         9616        53.33
       4.287     0.984375         9646        64.00
       4.743     0.985938         9662        71.11
       5.023     0.987500         9677        80.00
       5.399     0.989062         9693        91.43
       5.891     0.990625         9708       106.67
       6.611     0.992188         9723       128.00
       6.955     0.992969         9731       142.22
       7.355     0.993750         9738       160.00
       7.919     0.994531         9746       182.86
       9.007     0.995313         9754       213.33
       9.815     0.996094         9761       256.00
      10.383     0.996484         9765       284.44
      11.103     0.996875         9769       320.00
      12.559     0.997266         9773       365.71
      12.943     0.997656         9777       426.67
      13.495     0.998047         9780       512.00
      14.175     0.998242         9782       568.89
      14.359     0.998437         9784       640.00
      15.215     0.998633         9786       731.43
      15.615     0.998828         9788       853.33
      16.463     0.999023         9790      1024.00
      17.391     0.999121         9791      1137.78
      17.663     0.999219         9792      1280.00
      18.127     0.999316         9793      1462.86
      19.087     0.999414         9794      1706.67
      20.783     0.999512         9795      2048.00
      20.783     0.999561         9795      2275.56
      23.983     0.999609         9796      2560.00
      23.983     0.999658         9796      2925.71
      24.287     0.999707         9797      3413.33
      24.287     0.999756         9797      4096.00
      24.287     0.999780         9797      4551.11
      24.639     0.999805         9798      5120.00
      24.639     0.999829         9798      5851.43
      24.639     0.999854         9798      6826.67
      24.639     0.999878         9798      8192.00
      24.639     0.999890         9798      9102.22
      32.063     0.999902         9799     10240.00
      32.063     1.000000         9799          inf
#[Mean    =        2.059, StdDeviation   =        1.045]
#[Max     =       32.048, Total count    =         9799]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10001 requests in 8.33m, 2.17MB read
Requests/sec:     20.00
Transfer/sec:      4.43KB