results/histogram/wrk_service_3k_churn.log
Running 17m test @ http://172.30.57.114:5432/
  1 threads and 1 connections
  Thread calibration: mean lat.: 105.058ms, rate sampling interval: 1015ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.08ms    1.24ms  45.57ms   97.34%
    Req/Sec    19.30      0.46    20.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.95ms
 75.000%    2.20ms
 90.000%    2.58ms
 99.000%    6.44ms
 99.900%   19.61ms
 99.990%   28.91ms
 99.999%   45.60ms
100.000%   45.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.860     0.000000            1         1.00
       1.410     0.100000         2002         1.11
       1.581     0.200000         3968         1.25
       1.713     0.300000         5942         1.43
       1.829     0.400000         7934         1.67
       1.949     0.500000         9913         2.00
       2.001     0.550000        10894         2.22
       2.053     0.600000        11891         2.50
       2.103     0.650000        12892         2.86
       2.153     0.700000        13875         3.33
       2.205     0.750000        14856         4.00
       2.235     0.775000        15365         4.44
       2.269     0.800000        15854         5.00
       2.315     0.825000        16361         5.71
       2.373     0.850000        16835         6.67
       2.479     0.875000        17333         8.00
       2.529     0.887500        17578         8.89
       2.581     0.900000        17821        10.00
       2.647     0.912500        18072        11.43
       2.717     0.925000        18318        13.33
       2.801     0.937500        18565        16.00
       2.847     0.943750        18688        17.78
       2.897     0.950000        18816        20.00
       2.943     0.956250        18934        22.86
       3.017     0.962500        19057        26.67
       3.131     0.968750        19182        32.00
       3.239     0.971875        19243        35.56
       3.505     0.975000        19306        40.00
       3.889     0.978125        19366        45.71
       4.335     0.981250        19428        53.33
       4.835     0.984375        19490        64.00
       5.147     0.985938        19521        71.11
       5.507     0.987500        19552        80.00
       6.019     0.989062        19583        91.43
       6.747     0.990625        19614       106.67
       7.351     0.992188        19645       128.00
       7.687     0.992969        19660       142.22
       8.255     0.993750        19676       160.00
       8.975     0.994531        19691       182.86
      10.039     0.995313        19707       213.33
      11.327     0.996094        19722       256.00
      11.735     0.996484        19730       284.44
      12.103     0.996875        19738       320.00
      12.695     0.997266        19745       365.71
      13.519     0.997656        19753       426.67
      15.127     0.998047        19761       512.00
      15.287     0.998242        19765       568.89
      16.359     0.998437        19769       640.00
      17.135     0.998633        19772       731.43
      18.255     0.998828        19776       853.33
      20.383     0.999023        19780      1024.00
      21.055     0.999121        19782      1137.78
      21.711     0.999219        19784      1280.00
      22.783     0.999316        19786      1462.86
      23.247     0.999414        19788      1706.67
      23.775     0.999512        19790      2048.00
      23.871     0.999561        19791      2275.56
      24.863     0.999609        19792      2560.00
      26.687     0.999658        19793      2925.71
      27.231     0.999707        19794      3413.33
      27.311     0.999756        19795      4096.00
      27.311     0.999780        19795      4551.11
      28.047     0.999805        19796      5120.00
      28.047     0.999829        19796      5851.43
      28.911     0.999854        19797      6826.67
      28.911     0.999878        19797      8192.00
      28.911     0.999890        19797      9102.22
      33.727     0.999902        19798     10240.00
      33.727     0.999915        19798     11702.86
      33.727     0.999927        19798     13653.33
      33.727     0.999939        19798     16384.00
      33.727     0.999945        19798     18204.44
      45.599     0.999951        19799     20480.00
      45.599     1.000000        19799          inf
#[Mean    =        2.081, StdDeviation   =        1.242]
#[Max     =       45.568, Total count    =        19799]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20001 requests in 16.67m, 4.33MB read
Requests/sec:     20.00
Transfer/sec:      4.43KB